tutorials/lagrangian/reactingParcelFoam/rivuletPanel/0/wallFilmRegion/Tf
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/wallFilmRegion";
    object      Tf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform  300;

boundaryField
{
    wallFilmFaces_top
    {
        type            zeroGradient;
    }

    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 300;
    }

    outlet
    {
        type            zeroGradient;
    }

    sides
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
